/*
*********************************************************************************************************
*
*   模块名称 : 变频器参数
*   文件名称 : function_FunctionCode.h
*   版    本 : V1.0
*   说    明 : 头文件
*
*********************************************************************************************************
*/
#ifndef _F_FUNCTIONCODE_H_
#define _F_FUNCTIONCODE_H_
#include "stdint.h"
// EEPROM校验字
#define EEPROM_CHECK_1       (SOFTWARE_VERSION)              // EEPROM校验字1   与软件版本有关
#define EEPROM_CHECK_2       (FNUM_EEPROM)                   // EEPROM校验字2  所有要保存的功能码个数
// 功能码索引以及功能码组索引，得到的值为功能码的顺序值
#define CodeSerialNum(codeVFD)           ((uint16_t)((&(codeVFD)) - (&(FunctionCodeVFD.allVFD[0]))))
#define GradeSerialNum(group, grade)  (FunctionCodeGradeSum[group] + (grade))
//功能码的属性
// 单位bit3-5
#define ATTRIBUTE_UNIT_HZ_BIT           0
#define ATTRIBUTE_UNIT_A_BIT            1
#define ATTRIBUTE_UNIT_V_BIT            2
// 读写属性 bit 11-12
#define ATTRIBUTE_READ_AND_WRITE        0   // (任何时候)可写
#define ATTRIBUTE_READ_ONLY_WHEN_RUN    1   // 运行时只读
#define ATTRIBUTE_READ_ONLY_ANYTIME     2   // 只读
// 多个功能码的组合属性，跟上下限有关
#define ATTRIBUTE_MULTI_LIMIT_SINGLE    0   // 单独的功能码
#define ATTRIBUTE_MULTI_LIMIT_DEC       1   // 多个功能码，十进制
#define ATTRIBUTE_MULTI_LIMIT_HEX       2   // 多个功能码，十六进制
extern const uint16_t FunctionCodeGradeSum[];
struct  FUNC_ATTRIBUTE_BITS
{
    // bit    功能
    uint16_t point:3;         // 2-0    000：无小数点 001：1位小数，...，100：4位小数
    uint16_t unit:3;          // 5:3    000：无单位，001：hz,:010：A, 011：RPM, 100：V, 110-%;
    uint16_t displayBits:3;   // 8:6    000：显示0位，001：显示1位，...，101：显示5位
    uint16_t upperLimit:1;    // 9      1-参数由上限相关功能码限制，0-直接由上限限制
    uint16_t lowerLimit:1;    // 10     1-参数由下限相关功能码限制，0-直接由下限限制
    uint16_t writable:2;      // 12:11  00：可以读写, 01：运行中只读，10：参数只读
    uint16_t signal:1;        // 13     0：无符号; 1：有符号
    uint16_t multiLimit:2;    // 15:14  00-单独功能码(非组合);
    //        01-十进制,  多个功能码的组合;
    //        10-十六进制,多个功能码的组合;
};
union FUNC_ATTRIBUTE
{
    uint16_t                    allVFD;
    struct FUNC_ATTRIBUTE_BITS  bitVFD;
};
//=====================================================================
// 功能码属性表：上限、下限、出厂值、属性
//
typedef struct FUNCCODE_ATTRIBUTE_STRUCT_VFD
{
    uint16_t                  lower;          // 下限
    uint16_t                  upper;          // 上限
    uint16_t                  init;           // 出厂值
    union FUNC_ATTRIBUTE      attribute;      // 属性
} FUNCCODE_ATTRIBUTE_VFD;
extern const FUNCCODE_ATTRIBUTE_VFD funcCodeAttributeVFD[];
struct PLC_STRUCT           //PLC功能用的结构体
{
    uint16_t runTime;         // PLC第_段运行时间
    uint16_t accDecTimeSet;   // PLC第_段加减速时间选择
};
struct AI_SET_CURVE  // AI设定曲线
{
    uint16_t minIn;       // 曲线最小输入(电压值)
    uint16_t minInSet;    // 曲线最小输入对应设定(百分比)
    uint16_t maxIn;       // 曲线最大输入(电压值)
    uint16_t maxInSet;    // 曲线最大输入对应设定(百分比)
};
struct AI_JUMP    //模拟量跳跃
{
    uint16_t point;   // 设定跳跃点
    uint16_t arrange; // 设定跳跃幅度
};
struct ANALOG_CALIBRATE_CURVE  // 模拟量校正曲线，AIAO
{
    uint16_t before1;     // 校正前电压1
    uint16_t after1;      // 校正后电压1
    uint16_t before2;     // 校正前电压2
    uint16_t after2;      // 校正后电压2
};
typedef struct AO_PARA_STRUCT  //AO输出矫正
{
    uint16_t offset;          // AO零偏系数
    uint16_t gain;            // AO增益
} AO_PARA;
struct ERROR_SCENE_STRUCT
{
    uint16_t errorFrq;                    // 第三次(最近一次)故障时频率
    uint16_t errorCurrent;                // 第三次(最近一次)故障时电流
    uint16_t errorGeneratrixVoltage;      // 第三次(最近一次)故障时母线电压
    uint16_t errorDiStatus;               // 第三次(最近一次)故障时输入端子状态
    uint16_t errorTemp;                   // 第三次(最近一次)故障时变频器模块温度
    uint16_t errorInverterStatus;         // 第三次(最近一次)故障时变频器状态
    uint16_t errorTimeFromPowerUp;        // 第三次(最近一次)故障时时间（从本次上电开始计时）
    uint16_t errorTimeFromRun;            // 第三次(最近一次)故障时时间（从运行时开始计时）
};
union ERROR_SCENE
{
    uint16_t allVFD[sizeof(struct ERROR_SCENE_STRUCT)/2];
    struct ERROR_SCENE_STRUCT elem;
};
//=================================
#define MOTOR_TYPE_ACI_GENERAL  0   // 普通异步电机
#define MOTOR_TYPE_ACI_INV      1   // 变频异步电机
#define MOTOR_TYPE_PMSM         2   // 永磁同步电机
//------------------------------------------------
struct VC_PARA
{
    uint16_t vcSpdLoopKp1;            //   速度环比例增益1
    uint16_t vcSpdLoopTi1;            //   速度环积分时间1
    uint16_t vcSpdLoopChgFrq1;        //   切换频率1
    uint16_t vcSpdLoopKp2;            //   速度环比例增益2
    uint16_t vcSpdLoopTi2;            //   速度环积分时间2
    uint16_t vcSpdLoopChgFrq2;        //   切换频率2
    uint16_t vcSlipCompCoef;          //   转差补偿系数
    uint16_t vcSpdLoopFilterTime;     //  速度环滤波时间常数
    uint16_t vcOverMagGain;           //   矢量控制过励磁增益
    uint16_t spdCtrlDriveTorqueLimitSrc;  //   速度控制(驱动)转矩上限源
    uint16_t spdCtrlDriveTorqueLimit;     //   速度控制(驱动)转矩上限数字设定
    uint16_t spdCtrlBrakeTorqueLimitSrc;  //   速度控制(制动)转矩上限源
    uint16_t spdCtrlBrakeTorqueLimit;     //  速度控制(制动)转矩上限数字设定
    uint16_t mAcrKp;                  //   M轴电流环Kp
    uint16_t mAcrKi;                  //   M轴电流环Ki
    uint16_t tAcrKp;                  //   T轴电流环Kp
    uint16_t tAcrKi;                  //    T轴电流环Ki
    uint16_t spdLoopI;                //   速度环积分属性
    uint16_t weakFlusMode;            // 同步机弱磁模式
    uint16_t weakFlusCoef;            // 同步机弱磁系数
    uint16_t weakFlusCurMax;          //  最大弱磁电流
    uint16_t weakFlusAutoCoef;        // 弱磁自动调谐系数
    uint16_t weakFlusIntegrMul;       //  弱磁积分倍数
};
//------------------------------------------------
// 电机参数，包括电机参数、控制参数
struct MOTOR_FC
{
    // 电机基本参数
    uint16_t motorType;               //   电机类型选择
    uint16_t ratingPower;             //   电机额定功率
    uint16_t ratingVoltage;           //   电机额定电压
    uint16_t ratingCurrent;           //   电机额定电流
    uint16_t ratingFrq;               //   电机额定频率
    uint16_t ratingSpeed;             //   电机额定转速
    // 同步机调谐参数
    uint16_t pmsmRs;                  //   同步机定子电阻
    uint16_t pmsmLd;                  //   同步机d轴电感
    uint16_t pmsmLq;                  //   同步机q轴电感
    uint16_t pmsmInitPWMTs;            //   同步机转子位置检测脉宽
    uint16_t pmsmCoeff;               //  同步机反电动势系数
    uint16_t pmsmCheckTime;           //   同步机
    // PG卡参数
    uint16_t fvcPgSrc;                //     速度反馈PG卡选择, 0-QEP1,1-QEP2(扩展)
    uint16_t pgType;                  //     编码器类型
    uint16_t enCoderDir;              //     编码器相序/主方向
    uint16_t encoderPulse;            //     编码器脉冲线数
    uint16_t enCoderAngle;            //     编码器安装角
    uint16_t uvwSignDir;              //    UVW信号方向
    uint16_t uvwSignAngle;            //    UVW信号零点位置角
    uint16_t enCoderPole;             //   旋变极对数
    uint16_t rsvdF1_35;                //     UVW极对数
    uint16_t fvcPgLoseTime;           //    速度反馈PG断线检测时间
    uint16_t tuneCmd;                 // 调谐命令
    struct VC_PARA vcPara;          // VC控制参数
    uint16_t MotorCtrlMode;           // 电机控制方式
    uint16_t accDecTimeMotor;         // 电机加减速时间选择
};
//------------------------------------------------/
#define AI_NUMBER               3           // AI端子个数
#define AO_NUMBER               2           // AO端子个数
#define HDI_NUMBER              1           // HDI端子个数
#define HDO_NUMBER              1           // HDO端子个数
#define DI_NUMBER               10          // 物理DI端子
#define DI_FUNC_NUMBER          49          // DI的功能选择数量
#define DO_NUMBER               5           // 物理DO端子
#define PLC_STEP_MAX            16          // PLC、多段指令段数
//=====================================================================
#define EEPROM_USE_LENGTH        FNUM_EEPROM    //所有要保存的功能码的长度也是eeprom的使用长度
#define EEPROM_INDEX_USE_INDEX        4     // 功能参数使用EEPROM起始
// 预留给其它使用的功能码index
#define FUNCCODE_RSVD4ALL_INDEX     CodeSerialNum(FunctionCodeVFD.codeVFD.rsvd4All)
#define REM_P_OFF_MOTOR_NUMBER     5   // 性能掉电记忆的参数个数
// 功能码的组数
#define FUNCCODE_GROUP_NUMBER  41  // 包括预留的组
// EEPROM中顺序: EEPROM_CHK, 其他顺序保存
//每组的组号
#define FUNCCODE_GROUP_A0   0       // A0组
#define FUNCCODE_GROUP_AE   7       // AE组
#define FUNCCODE_GROUP_AF   8       // AF组
#define FUNCCODE_GROUP_B0   9       // B0组
#define FUNCCODE_GROUP_BF   17      // BF组
#define FUNCCODE_GROUP_C0   18      // C0组
#define FUNCCODE_GROUP_CF   26      // CF组
#define FUNCCODE_GROUP_D0   27      // D0组
#define FUNCCODE_GROUP_D5   32      // D5组
#define FUNCCODE_GROUP_DF   35      // DF组
#define FUNCCODE_GROUP_U0   36      // U0组   故障显示
//这里有 两个组，为eeprom校验和掉电保存
#define FUNCCODE_GROUP_U1   39       // H0组，显示
#define FUNCCODE_GROUP_U2   40      // U1组   性能显示
//以下为现在使用的功能码个数定义，不包括保留的
#define A0PATAMETERNUM           (26)     // A0
#define A1PATAMETERNUM           (25)     // A1
#define A2PATAMETERNUM           (21)     // A2
#define A3PATAMETERNUM           (36)     // A3
#define A4PATAMETERNUM           (11)     // A4
#define A5PATAMETERNUM           (13)     // A5
#define A6PATAMETERNUM           (0 )     // A6
#define AEPATAMETERNUM           (23)     // AE
#define AFPATAMETERNUM           (20)     // AF
#define B0PATAMETERNUM           (31)     // B0
#define B1PATAMETERNUM           (19)     // B1
#define B2PATAMETERNUM           (53)     // B2
#define B3PATAMETERNUM           (9 )     // B3
#define B4PATAMETERNUM           (0 )     // B4
#define B5PATAMETERNUM           (0 )     // B5
#define B6PATAMETERNUM           (0 )     // B6
#define BEPATAMETERNUM           (0 )     // BE
#define BFPATAMETERNUM           (30)     // BF
#define C0PATAMETERNUM           (27)     // C0
#define C1PATAMETERNUM           (44)     // C1
#define C2PATAMETERNUM           (23)     // C2
#define C3PATAMETERNUM           (0 )     // C3
#define C4PATAMETERNUM           (29)     // C4
#define C5PATAMETERNUM           (0 )     // C5
#define C6PATAMETERNUM           (0 )     // C6
#define CEPATAMETERNUM           (0 )     // CE
#define CFPATAMETERNUM           (0 )     // CF
#define D0PATAMETERNUM           (29)     // D0
#define D1PATAMETERNUM           (52)     // D1
#define D2PATAMETERNUM           (0 )     // D2
#define D3PATAMETERNUM           (0 )     // D3
#define D4PATAMETERNUM           (0 )     // D4
#define D5PATAMETERNUM           (30)     // D5
#define D6PATAMETERNUM           (0 )     // D6
#define DEPATAMETERNUM           (0 )     // DE
#define DFPATAMETERNUM           (0 )     // DF
#define U0PATAMETERNUM           (35)     // U0
#define A0RSVDNUM              (10 )   // A0保留
#define A1RSVDNUM              (10 )   // A1保留
#define A2RSVDNUM              (10 )   // A2保留
#define A3RSVDNUM              (10 )   // A3保留
#define A4RSVDNUM              (10 )   // A4保留
#define A5RSVDNUM              (10 )   // A5保留
#define A6RSVDNUM              (10 )   // A6保留
#define AERSVDNUM              (10 )   // AE保留
#define AFRSVDNUM              (14 )   // AF保留
#define B0RSVDNUM              (0 )   // B0保留
#define B1RSVDNUM              (10 )   // B1保留
#define B2RSVDNUM              (10 )   // B2保留
#define B3RSVDNUM              (10 )   // B3保留
#define B4RSVDNUM              (10 )   // B4保留
#define B5RSVDNUM              (10 )   // B5保留
#define B6RSVDNUM              (10 )   // B6保留
#define BERSVDNUM              (10 )   // BE保留
#define BFRSVDNUM              (10 )   // BF保留
#define C0RSVDNUM              (10 )   // C0保留
#define C1RSVDNUM              (10 )   // C1保留
#define C2RSVDNUM              (10 )   // C2保留
#define C3RSVDNUM              (30 )   // C3保留
#define C4RSVDNUM              (10 )   // C4保留
#define C5RSVDNUM              (10 )   // C5保留
#define C6RSVDNUM              (10 )   // C6保留
#define CERSVDNUM              (10 )   // CE保留
#define CFRSVDNUM              (10 )   // CF保留
#define D0RSVDNUM              (10 )   // D0保留
#define D1RSVDNUM              (10 )   // D1保留
#define D2RSVDNUM              (10 )   // D2保留
#define D3RSVDNUM              (10 )   // D3保留
#define D4RSVDNUM              (10 )   // D4保留
#define D5RSVDNUM              (10 )   // D5保留
#define D6RSVDNUM              (10 )   // D6保留
#define DERSVDNUM              (10 )   // DE保留
#define DFRSVDNUM              (10 )   // DF保留
#define U0RSVDNUM              (10 )   // U0保留
// 以下为每个组的功能码个数，包括保留的
// 除FF组之外，每组预留5个功能码。为了在增加功能码时，尽量不用恢复出厂参数。
#define A0NUM           (A0PATAMETERNUM+ A0RSVDNUM  )   // A0
#define A1NUM           (A1PATAMETERNUM+ A1RSVDNUM  )   // A1
#define A2NUM           (A2PATAMETERNUM+ A2RSVDNUM  )   // A2
#define A3NUM           (A3PATAMETERNUM+ A3RSVDNUM  )   // A3
#define A4NUM           (A4PATAMETERNUM+ A4RSVDNUM  )   // A4
#define A5NUM           (A5PATAMETERNUM+ A5RSVDNUM  )   // A5
#define A6NUM           (A6PATAMETERNUM+ A6RSVDNUM  )   // A6
#define AENUM           (AEPATAMETERNUM+ AERSVDNUM  )   // AE
#define AFNUM           (AFPATAMETERNUM+ AFRSVDNUM  )   // AF
#define B0NUM           (B0PATAMETERNUM+ B0RSVDNUM  )   // B0
#define B1NUM           (B1PATAMETERNUM+ B1RSVDNUM  )   // B1
#define B2NUM           (B2PATAMETERNUM+ B2RSVDNUM  )   // B2
#define B3NUM           (B3PATAMETERNUM+ B3RSVDNUM  )   // B3
#define B4NUM           (B4PATAMETERNUM+ B4RSVDNUM  )   // B4
#define B5NUM           (B5PATAMETERNUM+ B5RSVDNUM  )   // B5
#define B6NUM           (B6PATAMETERNUM+ B6RSVDNUM  )   // B6
#define BENUM           (BEPATAMETERNUM+ BERSVDNUM  )   // BE
#define BFNUM           (BFPATAMETERNUM+ BFRSVDNUM  )   // BF
#define C0NUM           (C0PATAMETERNUM + C0RSVDNUM )   // C0
#define C1NUM           (C1PATAMETERNUM + C1RSVDNUM )   // C1
#define C2NUM           (C2PATAMETERNUM + C2RSVDNUM )   // C2
#define C3NUM           (C3PATAMETERNUM + C3RSVDNUM )   // C3
#define C4NUM           (C4PATAMETERNUM + C4RSVDNUM )   // C4
#define C5NUM           (C5PATAMETERNUM + C5RSVDNUM )   // C5
#define C6NUM           (C6PATAMETERNUM + C6RSVDNUM )   // C6
#define CENUM           (CEPATAMETERNUM + CERSVDNUM )   // CE
#define CFNUM           (CFPATAMETERNUM + CFRSVDNUM )   // CF
#define D0NUM           (D0PATAMETERNUM + D0RSVDNUM )   // D0
#define D1NUM           (D1PATAMETERNUM + D1RSVDNUM )   // D1
#define D2NUM           (D2PATAMETERNUM + D2RSVDNUM )   // D2
#define D3NUM           (D3PATAMETERNUM + D3RSVDNUM )   // D3
#define D4NUM           (D4PATAMETERNUM + D4RSVDNUM )   // D4
#define D5NUM           (D5PATAMETERNUM + D5RSVDNUM )   // D5
#define D6NUM           (D6PATAMETERNUM + D6RSVDNUM )   // D6
#define DENUM           (DEPATAMETERNUM + DERSVDNUM )   // DE
#define DFNUM           (DFPATAMETERNUM + DFRSVDNUM )   // DF
#define U0NUM           (U0PATAMETERNUM + U0RSVDNUM )   // U0
#define CHK_NUM         (4)        //   eeprom检查标记个数
#define REM_NUM         (48)       //   所有掉电记忆保存的功能码个数
#define U1NUM           (50)      //   U1显示参数组个数，不进行eeprom保存
#define U2NUM           (40)      //   U2显示参数组个数，不进行eeprom保存
//所有的功能码个数（不包括显示的）
#define FNUM_PARA      (A0NUM + A1NUM + A2NUM + A3NUM +     \
                        A4NUM + A5NUM + A6NUM + AENUM +     \
                        AFNUM +                             \
                                                            \
                        B0NUM + B1NUM + B2NUM + B3NUM +     \
                        B4NUM + B5NUM + B6NUM + BENUM +     \
                        BFNUM +                             \
                                                            \
                        C0NUM + C1NUM + C2NUM + C3NUM +     \
                        C4NUM + C5NUM + C6NUM + CENUM +     \
                        CFNUM +                             \
                                                            \
                        D0NUM + D1NUM + D2NUM + D3NUM +     \
                        D4NUM + D5NUM + D6NUM + DENUM +     \
                        DFNUM +                             \
                                                            \
                        U0NUM                               \
                        )
//所有需要保存在eeprom中的功能码个数
#define FNUM_EEPROM    (FNUM_PARA + CHK_NUM + REM_NUM)
// 所有功能码、参数，包括显示
#define FNUM_ALL       (FNUM_EEPROM + U1NUM + U2NUM )
//==============================功能码组===================================//
struct FUNCCODE_GROUP
{
    uint16_t a0[A0NUM];               // A0
    uint16_t a1[A1NUM];               // A1
    uint16_t a2[A2NUM];               // A2
    uint16_t a3[A3NUM];               // A3
    uint16_t a4[A4NUM];               // A4
    uint16_t a5[A5NUM];               // A5
    uint16_t a6[A6NUM];               // A6
    uint16_t ae[AENUM];               // AE
    uint16_t af[AFNUM];               // AF
    uint16_t b0[B0NUM];               // B0
    uint16_t b1[B1NUM];               // B1
    uint16_t b2[B2NUM];               // B2
    uint16_t b3[B3NUM];               // B3
    uint16_t b4[B4NUM];               // B4
    uint16_t b5[B5NUM];               // B5
    uint16_t b6[B6NUM];               // B6
    uint16_t be[BENUM];               // BE
    uint16_t bf[BFNUM];               // BF
    uint16_t c0[C0NUM];               // C0
    uint16_t c1[C1NUM];               // C1
    uint16_t c2[C2NUM];               // C2
    uint16_t c3[C3NUM];               // C3
    uint16_t c4[C4NUM];               // C4
    uint16_t c5[C5NUM];               // C5
    uint16_t c6[C6NUM];               // C6
    uint16_t ce[CENUM];               // CE
    uint16_t cf[CFNUM];               // CF
    uint16_t d0[D0NUM];               // D0
    uint16_t d1[D1NUM];               // D1
    uint16_t d2[D2NUM];               // D2
    uint16_t d3[D3NUM];               // D3
    uint16_t d4[D4NUM];               // D4
    uint16_t d5[D5NUM];               // D5
    uint16_t d6[D6NUM];               // D6
    uint16_t de[DENUM];               // DE
    uint16_t df[DFNUM];               // DF
    uint16_t u0[U0NUM];               // u0
    uint16_t fChk[CHK_NUM];           //eeprom校验组
    uint16_t remember[REM_NUM];       // 掉电记忆组
    uint16_t u1[U1NUM];               // u1 显示组
    uint16_t u2[U2NUM];               // u2
};
//=============================功能码================================//
struct FUNCCODE_CODE_VFD
{
    // A0 基本功能组
    uint16_t MotorCtrlMode;           // A0-00  (电机)控制方式
    uint16_t RunCommandSelect;        // A0-01  命令源选择
    uint16_t FrqCalcSelect;           // A0-02  频率源选择
    uint16_t FrqXSelect;              // A0-03  主频率源X选择
    uint16_t FrqNumerical;            // A0-04  频率数字设定
    uint16_t FrqPoint;                // A0-05  频率指令小数点
    uint16_t FNumericalRecall;        // A0-06  数字设定频率记忆选择
    uint16_t FrqYSelect;              // A0-07  辅助频率源Y选择
    uint16_t FrqYRangeBase;           // A0-08  辅助频率源Y范围选择
    uint16_t FrqYRange;               // A0-09  辅助频率源Y范围
